Tutorials/2D/Langley-Beta1p1-fine/0.orig/constr.include
    wedge1
    {
	type		wedge;
    }

    wedge2
    {
	type		wedge;
    }

    axes
    {
	type		slip;
    }
    