Tutorials/2D/Langley-Beta1p1-fine/Allrun.mpi
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

rm -rf 0; cp -rf 0.orig/ 0/

runApplication blockMesh
runApplication decomposePar
runApplication mpirun -np 5 `getApplication` -parallel
runApplication reconstructPar
runApplication postProcess -func sampleDict

#------------------------------------------------------------------------------
